Repository: mariofornaroli/Mario_Fornaroli_CV
Catalog: Resources/Resources.*.resx
Languages: it

source: About me
it: Presentazione

source: Aerospace domain
it: Settore aerospaziale

source: and certificates
it: e certificazioni

source: Banking domain
it: Software per le banche

source: Bilingual
it: Bilingue

source: Contact
it: Contattami

source: Contact me
it: Contattami

# diplomaIT
source: Diploma in Information Technology
it: Perito Informatico

source: Download as PDF
it: Download PDF

source: Education
it: Istruzione

source: Email Address
it: Indirizzo Email

source: English
it: Inglese

# englishKnowledgeDescription
source: I've been working in a multicultural environment where English is the main common language for the last 5 years. During my academic period I took summer courses in English every year in UK, Ireland or Malta.
it: Lavoro da anni in un ambiente multiculturale dove l’Inglese è la lingua comune. Inoltre da quando ho 15 anni, fino alla fine dell’università ho trascorso periodi estivi di vacanze-studio in Irlanda e Inghilterra.

source: Experience
it: Lavori

source: Fluent
it: Fluente

source: French
it: Francese

# frenchKnowledgeDescription
source: I've been living in France and Belgium for the last 5 years. Moreover, having a French speaking wife, I speak French every day.
it: Ho vissuto in Francia e in Belgio negli ultimi 5 anni. Avendo una moglie belga francofona, lo parlo quotidianamente.

source: Good
it: Buono

source: ICT Consultant
it: Consulente ICT

source: Italian
it: Italiano

# itisVoltaLodi
source: I.T.I.S. A.Volta in Lodi, Italy
it: I.T.I.S. A.Volta a Lodi, Italia

# languagesTtrainings
source: languages, trainings
it: lingue, formazioni

# masterAndBachlorDegree
source: Master and Bachlor Degree (110/110 cum Laude)
it: Laurea Triennale e Specialistica (110/110 e Lode)

source: Message
it: Messaggio

source: Modules and Libraries
it: Sviluppo di librerie

source: Mother tongue
it: Madre lingua

source: My Expertise
it: Competenze

source: Name
it: Nome

source: Other
it: Altri dati

source: Other Skills
it: Altre Competenze

source: Other technologies
it: Altre tecnologie

# pesentingSentence
source: Hi, I'm a software engineer and I love everything related to software development for web and mobile platforms.
it: Mi occupo di sviluppo software e mi appassiona tutto cio' che riguarda la programmazione di software per Web e Mobile.

source: Present
it: Attualmente

source: Projects
it: Progetti

source: Projects with other languages
it: Progetti con altri linguaggi

# PythonInDotNet
source: Python integrated in .Net
it: Python integrato in .Net

source: Send
it: Invia

source: Software Developer
it: Sviluppatore Software

# softwareDeveloperCapital
source: SOFTWARE DEVELOPER
it: PROGRAMMATORE SOFTWARE

source: Spanish
it: Spagnolo

# spanishKnowledgeDescription
source: I spent 8 months in Spain attending the University of Extremadura participating to the ERASMUS project. DELE (Diploma de Español como Lengua Extranjera) Certificate awarded in 2009.
it: Ho trascorso l’Erasmus in Spagna (8 mesi, nel 2009), dove parlavo spagnolo ed ho potuto conseguire il diploma DELE (Diploma de Español como Lengua Extranjera).

source: Teacher eBook
it: Registro per professori

# universityOfPavia
source: University of Pavia, Italy
it: Universita' degli Studi di Pavia, Italia

source: Web developer
it: Programmatore Web

source: Windows applications
it: Applicazioni Windows

source: Belgium
it: Belgio

source: Brussels
it: Bruxelles

source: Certificates
it: Certificazioni

# ISTQBTesterCertificate
source: ISTQB Certified Software Tester
it: ISTQB Software Tester

source: January
it: Gennaio

source: March
it: Marzo

source: Online Trainings
it: Formazioni Online

source: Trainings and
it: Formazioni e

source: LeclNotes Web Application
it: LeclNotes Applicazione Web

# CandCppDllDevelopment
source: C/C++ Modules and libraries development
it: Sviluppo di DLL C/C++

# cSharpDotNetApplications
source: C# .Net Applications
it: Applicazioni C# .Net

# ironPythonForTesting
source: IronPython Application for Testing
it: IronPython in .Net per applicazione di test

source: Visit it
it: Visita l'applicazione

# aboutMe_Sentence_1
source: Hi, I graduated with a First in Electronic and ICT Engineering from the University of Pavia in Italy in 2009 and I got a High School Diploma in Computer Technology in 2006.
it: Mi sono laureato in Ingegneria Elettronica e delle Telecomunicazioni all’Università di Pavia nel 2009. Alle scuole superiori mi sono diplomato come Perito informatico nel 2003.

# aboutMe_Sentence_2
source: I have a strong background in Information Technology as I carried out various IT projects during my professional experience.
it: Ho un forte background in informatica avendo sempre lavorato in quel settore e sviluppato applicazioni per progetti di diverso tipo.

# aboutMe_Sentence_3
source: I’ve been working as software developer for 8 years and particularly as web and mobile developer for the last 5 years in different European cities.
it: Lavoro come sviluppatore software da 7 anni ed in particolare negli ultimi 4 come svilupatore web. Ho lavorato 1.5 anni a Toulouse, 4 anni a Bruxelles e da 1.5 anni vivo e lavoro a Bologna.

# diplomaDescription
source: Specializations in Computer Science.
it: Perito informatico.

# masterThesisDescription
source: Master thesis on “Processing of Hyperspectral Remote Sensing data” at University of Extremadura, Spain (supervisors Prof. P.Gamba from University of Pavia-Italy and Prof. A.Plaza from University of Extremadura-Spain).
it: Tesi specialistica dal titolo “Processing of Hyperspectral Remote Sensing data” svolta all’Università di Extremadura, Spagna con la supervisione del Prof. P.Gamba dell’Università di Pavia, Italia e del Prof. A.Plaza dell’Università di Extremadura, Spagna.

# myExpertise_Sentence_1
source: During my work experience I have developed various web applications, mainly working with the following technologies: AngularJS, plus obviously Jquery-html5-css3-js, (frontend side) and .Net technologies, such as Web API/Asp MVC - Entity Framework – Microsoft Sql server (backend side).
it: Nella mia carriera lavorativa ho sviluppato diverse applicazioni web, lavorando principalmente con le seguenti tecnologie: AngularJS, e ovviamente Jquery-html5-css3-js, (lato frontend) e tecnologie .Net, come Web API/Asp MVC - Entity Framework – Microsoft Sql server (lato backend).

# myExpertise_Sentence_2
source: In my first years I also developed Windows applications (mainly C# .Net with WPF), multi-platform applications (C++ Qt framework for Linux), often in the domain of cryptography and security, and I DLLs (C/C++ language) to communicate with external devices through API.
it: Nei primi anni ho anche sviluppato applicazioni desktop (principalmente con C# WPF), applicazioni multi-platform (C++ Qt framework per Linux), spesso nel campo della sicurezza e della crittografia, e DLLs (linguaggio C/C++) per comunicare con dispositivi esterni attraverso API.

# myExpertise_Sentence_3
source: I have also developed DLLs (C/C++ language) to communicate with external devices through API. I developed a couple of modules (C language) to embed in a Hardware Security Module in the domain of cryptography for the brand protection market.
it: Ho anche sviluppato DLLs (linguaggio C/C++) per comunicare con dispositivi esterni attraverso API. Ho sviluppato due di moduli (linguaggio C) da installare in un HSM (Hardware Security Module) nel dominio della crittografia per applicazioni di autentificazione e sicurezza.

# myExpertise_Sentence_4
source: I enjoy a lot working with Microsoft Visual Studio! It is my favorite IDE. I also developed some project with Qt Creator and Borland/Embarcadero.
it: Mi piace molto lavorare con Visual Studio! E’ il mio IDE preferito. Ho anche lavorato in altri progetti con Qt Creator e Borland/Embarcadero.

# myExpertise_Sentence_5a
source: I am passionate about my job!
it: Il mio lavoro mi appassiona!

# myExpertise_Sentence_5b
source: I constantly train myself, mainly through online courses the evening after the work.
it: Seguo costantemente dei corsi di formazione. Di solito online, la sera dopo il lavoro.

# training_online_1
source: I'm continuously training myself, mainly through online courses. I do it very often in the evening after the job.
it: Seguo costantemente formazioni, in prevalenza online. Di solito le seguo la sera dopo la giornata lavorativa.

# training_online_2
source: I am a big fun of Microsoft Virtual Academy and I am in the top 100 ranking of my country. That's where I mainly follow the online courses. Other websites I stay tuned with are Udemy and Coursera.
it: Tra i siti di formazione online che seguo con più frequenza, c’è of Microsoft Virtual Academy. Questa piattaforma organizza un sistema di formazione a punti, in cui sono classificato tra i primi 100 del mio Paese. Altri siti con i quali ho seguito e seguo formazioni ci sono Coursera e Udemy.

# work_CallistoSpace1
source: I’ve worked on a study of feasibility to investigate solutions for building a new ESA (European Space Agency) antennas ground station for future Deep Space missions. In the course of this study I developed two main software.
it: Ho lavorato per l’Agenzia Spaziale Europea (ESA) nell’ambito di uno studio di fattibilita’ per costruire una nuova stazione di antenne per missioni spaziali di tipo Deep Space. In questo progetto ho realizzato due software.

# work_CallistoSpace2
source: One to monitor and control various external devices using TCP/IP, Serial and USB connections (LabVIEW).
it: Il primo applicativo consiste in un sistema di monitoring di diversi dispositivi esterni attraverso TCP/IT, porta seriale e connessione USB (linguaggio LabView).

# work_CallistoSpace3
source: The second is a simulator (C++) to coordinate the delays in antennas signals reception.
it: Il secondo software è un simulatore realizzato in C++ per simulare e correggere i ritardi tra i diversi segnali input e output in un array di antenne TX/RX.

# work_CW1
source: Development and implementation of software to manage banking activities. I’ve developed mainly in Cobol and SQL and I’ve provided debugging activities of Java programs.
it: Ho sviluppato software nel settore bancario. In particolare mi sono occupato migrazione dei dati clienti tra due database. I linguaggi utilizzati sono SQL e Cobol.

# work_CW2
source: I’ve worked on client site (Crediti Agricole bank) as customer support engineer providing solutions for core-banking activities.
it: Ho lavorato presso il cliente, la banca Crédit Agricole.

# work_STM1
source: I worked as developer in the software tool department. I developed web and desktop applications for internal and external customers, mainly in the domain of cryptography and security.
it: Lavoro come sviluppatore software nel dipartimento Software Tool Department. Ho programmato applicazioni per clienti interni ed esterni, principalmente nel settore della sicurezza e della crittografia.

# work_STM2
source: I mainly developed Windows applications in .Net (c# WPF) and Dlls in C/C++. Some other smaller project I realized involved Delphi, and Python languages and Qt framework.
it: Ho sviluppato diverse applicazioni Windows in .Net (C# WPF). Tra gli altri progetti realizzati vi è lo sviluppo di DLLs a moduli in C/C++. Sono anche stato coinvolto in progetti in cui i linguaggi utilizzati erano Delphi, Python ed il framework Qt.

# work_WebFreelance1
source: Being passionate about web development, I decided to develop web and mobile applications as freelance.
it: Essendo appassionato di sviluppo web, ho deciso di sviluppare applicazioni web come seconda attività.

# work_WebFreelance2
source: I mainly work with Asp .NET MVC, Entity Framework and SQL Server (server side), and HTML5-CSS-Javascript, AngularJS and JQuery (client side).
it: Ho principalmente utilizzato tecnologia Asp .NET MVC, Entity Framework and SQL Server (lato server), e HTML5-CSS-Javascript, AngularJS e JQuery (lato cliente).

source: Close
it: Chiudi

# cSharpAppDescription1
source: I developed applications in different domains. Among the others: cryptography, communication with external devices, chip behaviors simulators, printing applications and test oriented applications.
it: Ho sviluppato applicazioni per diversi settori. Tra gli altri: crittografia, comunicazione con dispositivi esterni, simulatori di chip, applicazioni di stampa e applicazioni per testare altri prodotti.

# cSharpAppDescription2
source: For desktop applications I mainly worked with WPF, MVVM pattern, using DevExpress components.
it: Per applicazioni desktop, ho principalmente utilizzato linguaggio C# .Net con WPF, pattern MVVM, utilizzando componenti DevExpress dove necessario.

# cSharpAppDescription3
source: The installer packages for deployment were created through AdvancedInstaller.
it: I pacchetti pe l’installazione sono creati attraverso AdvancedInstaller software.

# IronPythonDescription1
source: My team and I developed what we called DeviceTesting application. It allows connecting and communicating with several devices connected to the host pc with the goal to test their functionalities. The list of supported communication protocols is broad as well as the type of devices supported, mainly in the field of smartcatds and microchips.
it: Insieme al team di sviluppo abbiamo creato un sorta di IDE per sviluppare test script al fine di testare le funzionalità di altri dispositivi. La lista dei protocolli di comunicazione e dei dispositivi supportati è vasta, principalmente nel settore delle smartcard e dei microchip.

# IronPythonDescription2
source: The application is based on WPF, MVVN pattern, taking advantage of DevExpress components. It embeds IronPython to write the scripting tests. The used .NET logging framework is NLog.
it: L’ambiente è realizzato con C# WPF, componenti DevExpress. IronPython è utilizzato per integrare il linguaggio di script Python (utilizzato per i test) in C#. Il framework di log utilizzato è NLog.

# IronPythonDescription3
source: AdvancedInstaller is used for package and deployment.
it: AdvancedInstaller è utilizzato per realizzare il pacchetto d’installazione.

# leclNotesDescription
source: LeclNotes is a teacher eBook. It manages the list of classes, courses, students and votes of a teacher in a school calculating the average votes at different moments of the year. It can be easily extended and customized to be introduced in a school where each teacher has his account.
it: LeclNotes rappresenta il registro dei voti di un insegnante, per più classi. Permette di gestire la lista delle classi, dei corsi, degli studenti e dei voti permettendo di calcolare le medi per completare un pagellino. L'applicazione può essere facilmente estesa in modo da essere introdotta in una scuola in cui ogni professore accede attraverso il proprio conto.

# CandCppProjectsDescription1
source: I have developed DLLs (C/C++ language) to communicate with external devices through API. I developed two modules (C language) to embed in a Hardware Security Module (HSM) in the domain of cryptography for the brand protection market.
it: Ho sviluppato DLLs (linguaggio C/C++) per comunicare con dispositivi esterni attraverso API. Ho sviluppato due di moduli (linguaggio C) da installare in un HSM (Hardware Security Module) nel dominio della crittografia per applicazioni di autentificazione e sicurezza.

# CandCppProjectsDescription2
source: In the aerospace domain, I developed a tool (C++) to simulate the delays that the different signals can have when received by an array of antennas and their consequences on the Signal-to-noise ratio (S/N).
it: Nel settore aerospaziale ho sviluppato un simulatore realizzato in C++ per simulare e correggere i ritardi tra i diversi segnali input e output in un array di antenne TX/RX.

# CandCppProjectsDescription3
source: A key management tool realized in C++ (Qt framework) for Windows and Linux in the domain of PC security and keys storing.
it: Utilizzando il framework Qt, ho programmato un’applicazione per Windows e Linux (CentOS) per la gestione di chiavi di crittografia.

# otherProjectDescription1
source: SQL development in the context of a data base migration (Banking domain)
it: Un utilizzo importante del linguaggio SQL nell’ambito di un progetto di migrazione di dati da un database ad un altro nel settore bancario.

# otherProjectDescription2
source: Improvements of test environment written in Delphi to comply with Object Oriented Programming (SmartCard domain)
it: Ristrutturazione di alcuni applicativi già esistenti, realizzati in linguaggio Delphi, per meglio attenersi alla Programmazione Orientata agli Oggetti (OOP).

# otherProjectDescription3
source: Other minor applications developed with Delphi (SmartCard domain)
it: Altri piccole applicazioni sviluppate in linguaggio Delphi.

# otherProjectDescription4
source: LabVIEW software to monitor and control various external devices using TCP/IP, Serial and USB connections (Aerospace domain)
it: Software LabView per monitorare dispositivi esterni attraverso TCP/IP, porta seriale o USB.

# otherProjectSentence
source: Other projects involving technologies not mentioned before are:
it: Altri progetti sviluppati con tecnologie non citate in precedenza:

# lang
source: English
it: Italiano

# otherProjectDescription5
source: At university I developed a couple of projects using Matlab and Assembler MIPS.
it: All'università ho sviluppato un paio di progetti utilizzando Matlab e Assembler MIPS.

# mailTxFailure
source: An error occurred. Please verify that all fields have been correctly filled. <br/>Alternatively, please contact me directly at <a href= \"mailto:mario.fornaroli@yahoo.it\" >mario.fornaroli@yahoo.it</a>
it: Si è verificato un errore. Verifica che tutti i campi siano correttamente completati e prova a ritrasmettere il messaggio. <br/>In alternativa, contattami direttamente all’indirizzo <a href= \"mailto:mario.fornaroli@yahoo.it\" >mario.fornaroli@yahoo.it</a>

# mailTxSuccess
source: Message correctly sent, thanks.
it: Messaggio ricevuto correttamente, grazie.

# cryptoPlayerDescription1
source: CryptoPlayer is a cryptographic calculator. It allows the user to play with the different cryptographic operations. Symmetric and asymmetric cryptography. Hashing functions. RSA key generation. SSL certificate parsing, validation and creation.
it: CryptoPlayer e' una calcolatrice crittografica. Permette di eseguire diverse operazioni di crittografia. Algoritmi simmetrici ed asimmetrici. Funzioni di hashing. Generazione di chiavi RSA. Parsing, validazione e modifica dei certificati SSL.

# cryptoPlayerDescription2
source: The front end uses AngularJS and Bootstrap, while the backed uses .NET Web API.
it: Questa applicazione web e' realizzata, lato front-end, con AngularJS e Bootstrap e lato back-end con .NET Web API.

source: CryptoPlayer - web application
it: CryptoPlayer - applicazione web

source: Brussels, Belgium
it: Bruxelles, Belgio

# cSharpEgiliaTraining
source: C# Fundamentals
it: .Net and C# Fundamentals Training

# cSharpExamDate
source: Date of achievement: 28/04/2015
it: Date dell'esame: 28/04/2015

# cSharpExamPassed
source: CERTIFICATION EXAMS COMPLETED SUCCESSFULLY
it: TEST DI CERTIFICAZIONE SUPERATO

# bologna
source: Bologne
it: Bologna

source: Italy
it: Italia

# work_Euris1
source: I’ve been working as web developer in different projects, mainly in assurance and logistic distribution domain. I've developed web application in form of Single Page Application and we mainly use the following stack: mainly HTML5-CSS-Javascript, AngularJS and JQuery (client side) and .Net Web API, Asp .NET MVC, Entity Framework and SQL Server (server side).
it: Lavoro come web developer in diversi progetti, soprattutto per applicazioni web nel campo delle assicurazioni e della logistica. Sviluppio in team applicazioni web di tipo Single Page Application utilizzando principalmente spesso il seguente stack tecnologico:

# work_Euris2
source: The IDE I mainly use is Visual Studio. It’s my favorite one! I do daily use (or used in previous projects) various other tool such as automated task-runners, framework to document and test API’s, versioning tool, etc..
it: l'IDE che utilizzo è Visual Studio. E' l'ambiente di sviluppo che preferisco! Ovviamente nel quotidiano utilizzo una serie di altri strumenti come strumenti di automatizzazione dei task (ex.Gulp), Framework per documentare e testare le web API(ex.Swagger), sistemi di versioning (ex.TFS), etc... nella sezione progetti vi è una visualizzazione più esaustiva dei differenti strumenti che utilizzo nei vari progetti.

# elctrAndIctEngineeringTitle
source: Electronic and ICT Engineering
it: Ingegneria Elettronica e delle Telecomunicazioni

# chTitle
source: AngularJs / KnockoutJs + ASP MVC + WCF (insurance domain)
it: AngularJs / KnockoutJs + ASP MVC + WCF (dominio assicurazioni)

# porTitle
source: AngularJs + ASP MVC + Web API - Logistical domain
it: AngularJs + ASP MVC + Web API (dominio logistica)

# projectChDescription2
source: Front end developed with AngularJs / KnockoutJs + Jquery (plus obviously HTML5-CSS3-JS and other common js libraries)
it: Front end sviluppato con AngularJs / KnockoutJs + Jquery (più ovviamente HTML5-CSS3-JS ed altre librerie js popolari)

# projectChDescription3
source: Backend services exposed through WCF
it: Servizi esposti attraverso WCF

# projectChDescription4
source: MS SQL Server db with both Entity Framework and ADO .NET (stored procedure and direct sql commands)
it: MS SQL Server db utilizzato sia con Entity Framework che direttamente con ADO .NET (stored procedure e comandi sql da codice)

# projectChSentence
source: This web application is an insurance bureau suite of services for the UK market. It involves the following technologies:
it: Questa web app è un portale di servizi utilizzato da diverse agenzie assicurative in Gran Bretagna. Utilizza le seguenti tecnologie:

# projectsCh
source: Insurance bureau suite of services
it: Portale di servizi per agenzie assicurative

# projectsPor
source: Web portal to manage a logistic deposit
it: Portale per la gestione dei prodotti di una logistica

# projectsPorDescription1
source: AngularJs front end (plus obviously HTML5-CSS3-JS and other common js libraries)
it: AngularJs front end (con ovviamente HTML5-CSS3-JS ed altre librerie js popolari)

# projectsPorDescription2
source: .NET Web API to expose web services
it: .NET Web API per l'esposizione dei servizi web

# projectsPorDescription3
source: MS SQL Server db with Entity Framework
it: MS SQL Server db con Entity Framework

# projectsPorSentence
source: Web application to manage products in/out in logistic deposit. It involves the following technologies:
it: Questa web app è un portale per la gestione dei prodotti di una logistica. Utilizza le seguenti tecnologie:

# projectsH
source: Online service to automatize documents sending
it: Portale per l'invio online postale di documenti e raccomandate

# projectsHSentence
source: Web application to automatize sending mails and documents through online services. It involves the following technologies:
it: Questa web app è un portale per l'automatizzazione dell'invio postale di documenti e raccomandate tramite servizi online. Utilizza le seguenti tecnologie:

# porMobTitle
source: Cordova Android and potentially Ios app - Logistical domain
it: Applicazione Cordova Android e potenzialmente Ios (dominio logistica)

# projectsHDescription4
source: UX professionally designed - Material Design
it: UX realizzata da un'azienda terza - Material Design

# projectsPorMobDescription4
source: Online and Offline functioning
it: FunzionamentoOnline e Offline
