Repository: mariofornaroli/Mario_Fornaroli_CV
Catalog: Resources/Resources.*.resx
Languages: it

# projectsPorMobDescription5
source: Various Cordova Plugins (digital signature, camera, file system, white-list, etc...)
it: Vari Cordova Plugins (digital signature, camera, file system, white-list, etc...)
